Tekla Open API Reference for Tekla Structures 2025
Arc Constructor
Overload List
Name | Description
Arc(ViewBase, Point, Point, Double)
 Creates a new arc instance with standard attributes and the given two points and radius.
Arc(ViewBase, Point, Point, Point)
 Creates a new arc instance with standard attributes and the given three points.
Arc(ViewBase, Point, Point, Double, Arc.ArcAttributes)
 Creates a new arc instance with the given two points, radius and specified attributes.
Arc(ViewBase, Point, Point, Point, Arc.ArcAttributes)
 Creates a new arc instance with the given three points and specified attributes.
Top
See Also
Reference
Arc Class
Tekla.Structures.Drawing Namespace